# Repos
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"

# Homebrew (builds)
brew "autoconf"
brew "automake"
brew "pkg-config"
brew "ruby"
brew "mas" # For mac app store apps

# Base tools
brew "git-lfs"
brew "git"
brew "mercurial"
brew "tmux"
brew "vim"
brew "zsh"

# Utilities
brew "gnupg"
brew "sops"
brew "jq"
brew "age"
brew "bat"
brew "dos2unix"
brew "exa"
brew "fzf"
brew "git-delta"
brew "graphviz"
brew "htop"
brew "netcat", link: false # I use nmap ncat instead
brew "nmap"
brew "pandoc"
brew "pwgen"
brew "ripgrep"
brew "socat"
brew "starship"
brew "thefuck"
brew "tldr"
brew "tree"
brew "watch"
brew "websocat"
brew "wget"
brew "yq"
brew "zoxide"

# Java / JVM (Zulu OpenJDK)
cask "zulu-jdk11"
cask "zulu-jdk17"
cask "zulu"
brew "kotlin"
brew "ant"
brew "maven"
brew "gradle"
brew "sbt"

# Python
brew "python"
brew "pyenv"
brew "poetry"

# Go
brew "go"

# Javascript
brew "node"
brew "nvm"
brew "yarn"

# Shell scripting
brew "shellcheck"
brew "shfmt"

# Databases
brew "sqlite"
brew "libpq"

# REST
cask "insomnia"

# Docker
brew "dive"

# Kubernetes
brew "kubectx"
brew "kubernetes-cli"
brew "kustomize"
brew "minikube"

# Kafka
brew "librdkafka"
brew "kcat"

# GUIs
brew "mas" # Mac app store CLI
cask "insomnia"
cask "iterm2"
cask "visual-studio-code"
cask "joplin"
cask "alfred"
cask "yt-music"

# Mac App store
mas "Amphetamine", id: 937984704
mas "Magnet", id: 441258766
mas "Microsoft To Do", id: 1274495053
mas "PDF Toolkit", id: 405219581
mas "The Archive Browser", id: 510232205
mas "The Unarchiver", id: 425424353
